ams/src/Catalogs/AMS_ПравилаПродаж/AMS_ПравилаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_ПравилаПродаж</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Обрешетка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПравилаПродажи</name>
    <type>
      <types>EnumRef.AMS_СтатусыПравилПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыбораТипаОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыВнеПрайса</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/AMS_ПравилаПродаж/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	Иначе
		Владелец = ДанныеЗаполнения.Владелец;
	КонецЕсли;
	
	Соглашение = ПолучитьСоглашения(ДанныеЗаполнения.Владелец);
	
	Если НЕ Соглашение = Неопределено Тогда 
		Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "Организация,Контрагент");
		
		Если ЗначениеЗаполнено(Стр.Организация) Тогда
			Организация = Стр.Организация;
		Иначе
			Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();				
		КонецЕсли;
		
		Наименование = "" + Владелец + " с " + Организация;
		
		Если ЗначениеЗаполнено(Стр.Контрагент) Тогда
			Контрагент = Стр.Контрагент;
			
		Иначе
		    ТабКонтрагент = Справочники.AMS_ПравилаПродаж.ПолучитьКонтрагентов(Владелец);
			
			Если ТабКонтрагент.Количество() = 1 Тогда 
				Контрагент = ТабКонтрагент[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) и ЗначениеЗаполнено(Контрагент) Тогда
			ТабДоговор = Справочники.AMS_ПравилаПродаж.ПолучитьДоговора(Организация,Владелец,Контрагент);
			
			Если ТабДоговор.Количество() = 1 Тогда 
				Договор = ТабДоговор[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Организация = AMS_ВызовСервера.ОрганизацияКемикал() Тогда 
		Грузоотправитель = AMS_ВызовСервера.ПолучитьГрузоотправителяКемикал();
	КонецЕсли;

	Если ЗначениеЗаполнено(Владелец) Тогда
		Основное = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновноеПравилоПродаж(Владелец));
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Основное = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновноеПравилоПродаж(Владелец));
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Основное  Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ЗапросТекст = "ВЫБРАТЬ
			|	т.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.AMS_ПравилаПродаж КАК т
			|ГДЕ
			|	т.Владелец = &Владелец
			|	И т.Ссылка <> &Ссылка
			|	И т.Основное"; 
			
		Иначе
			ЗапросТекст = "ВЫБРАТЬ
			|	т.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.AMS_ПравилаПродаж КАК т
			|ГДЕ
			|	т.Владелец = &Владелец
			|	И т.Основное";
		КонецЕсли;
	
		Запрос.Текст = ЗапросТекст;
		
		Выб = Запрос.Выполнить().Выбрать();
		
		Пока Выб.Следующий() Цикл
			Объект = Выб.Ссылка.ПолучитьОбъект();
			Объект.Основное = Ложь;
			Объект.Записать();
		КонецЦикла;
	
	Иначе	
		Основное = Не ЗначениеЗаполнено(AMS_ВызовСервера.ПолучитьОсновноеПравилоПродаж(Владелец));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоглашения(Партнер)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартнерыСегмента.Сегмент КАК Сегмент
	|ПОМЕСТИТЬ сег
	|ИЗ
	|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|ГДЕ
	|	ПартнерыСегмента.Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ согл
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК т
	|ГДЕ
	|	т.Партнер = &Партнер
	|	ИЛИ т.СегментПартнеров В
	|		(ВЫБРАТЬ
	|			сег.Сегмент
	|		ИЗ
	|			сег КАК сег)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка,
	|	т.Статус КАК Статус,
	|	т.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	т.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	т.Типовое КАК Типовое
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК т
	|ГДЕ
	|	т.Ссылка В
	|		(ВЫБРАТЬ
	|			согл.Ссылка
	|		ИЗ
	|			согл КАК согл)
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
	|	И (т.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|	ИЛИ &ДатаАктуальности > т.ДатаНачалаДействия)
	|	И (т.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|	ИЛИ &ДатаАктуальности < т.ДатаОкончанияДействия)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Типовое";
		
	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
